lab-5/lab-notebook.org
:PROPERTIES:
:ID:       7d6eb9de-87e2-4bff-994d-0be10791ba38
:END:
#+title: anotações para a resolução do laboratório
#+author: Nícolas Rosenthal Dal Corso
#+date: \date
#+PROPERTY: header-args:python :session lab-5 :results output

* Dificuldades e Erros
[modelo /baseline/] (=n-rosenthal--submission-1=)
    ->
diversos modelos para testar e aprender técnicas avançadas
    ->
[modelo /stacking-ensemble 4/] (=n-rosenthal--submission-3=)


No modelo /baseline/:
1. Após definir um modelo /baseline/, percebi que tratei a coluna =Id= como outra coluna qualquer;
2. Na primeira vez, eu defini duas estratégias de imputação de valores ausentes, uma depois da outra. Isto ocasionou uma /dupla imputação/. Isso não faz sentido nenhum.



* Modelo /Baseline/
** Pré-Processamento dos Dados: Limpeza
*** Importação das Bibliotecas

#+BEGIN_SRC python :session lab-5 :results silent
import numpy as np
import pandas as pd
#+END_SRC

*** Leitura dos Dados
Ler os dados a partir de documento =.csv= e inspeção de sua dimensionalidade. Também vamos armazenar o numéro de colunas em uma variável de trabalho.

#+BEGIN_SRC python :session lab-5 :results output
train_df: pd.DataFrame = pd.read_csv(r"./lab05_files/lab05_files/train_student.csv");
test_df: pd.DataFrame  = pd.read_csv(r"./lab05_files/lab05_files/test_student.csv");

print("Dimensões:");
print("\tdados de treinamento: ", train_df.shape);
print("\tdados de teste      : ", test_df.shape);

n_cols: int = test_df.shape[1];
#+END_SRC

#+RESULTS:
: Dimensões:
: 	dados de treinamento:  (1022, 81)
: 	dados de teste      :  (438, 80)

Nosso objetivo é, a partir das =81=  colunas, predizer o valor da coluna =SalesPrice=. É observável também que os dados de teste possuem uma coluna a mais do que os dados de treinamento.

*** Diferença na Quantidade de Colunas
#+BEGIN_SRC python :session lab-5 :results output
train_cols = set(train_df.columns)
test_cols  = set(test_df.columns)

missing_in_test = train_cols - test_cols
extra_in_test   = test_cols - train_cols

print("Colunas em `train`, mas não em `test` :", end="")
print(missing_in_test)
print("\nColunas em `test`, mas não em `train` :", end="")
print(extra_in_test)
#+END_SRC

#+RESULTS:
: Colunas em `train`, mas não em `test` :{'SalePrice'}
: 
: Colunas em `test`, mas não em `train` :set()

