lab-5/lab-notebook.tex
% Created 2026-04-26 dom 18:26
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Nícolas Rosenthal Dal Corso}
\date{\date}
\title{anotações para a resolução do laboratório}
\hypersetup{
 pdfauthor={Nícolas Rosenthal Dal Corso},
 pdftitle={anotações para a resolução do laboratório},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Dificuldades e Erros}
\label{sec:orga6bcc0a}
{[}modelo /baseline/] (\texttt{n-rosenthal-{}-{}submission-1})
    ->
diversos modelos para testar e aprender técnicas avançadas
    ->
{[}modelo /stacking-ensemble 4/] (\texttt{n-rosenthal-{}-{}submission-3})


No modelo \emph{baseline}:
\begin{enumerate}
\item Após definir um modelo \emph{baseline}, percebi que tratei a coluna \texttt{Id} como outra coluna qualquer;
\item Na primeira vez, eu defini duas estratégias de imputação de valores ausentes, uma depois da outra. Isto ocasionou uma \emph{dupla imputação}. Isso não faz sentido nenhum.
\end{enumerate}
\section{Modelo \emph{Baseline}}
\label{sec:org883ef71}
\subsection{Pré-Processamento dos Dados: Limpeza}
\label{sec:org5404ad6}
\subsubsection{Importação das Bibliotecas}
\label{sec:org61bba53}

\begin{verbatim}
import numpy as np
import pandas as pd
\end{verbatim}
\subsubsection{Leitura dos Dados}
\label{sec:orgf34f21a}
Ler os dados a partir de documento \texttt{.csv} e inspeção de sua dimensionalidade. Também vamos armazenar o numéro de colunas em uma variável de trabalho.

\begin{verbatim}
train_df: pd.DataFrame = pd.read_csv(r"./lab05_files/lab05_files/train_student.csv");
test_df: pd.DataFrame  = pd.read_csv(r"./lab05_files/lab05_files/test_student.csv");

print("Dimensões:");
print("\tdados de treinamento: ", train_df.shape);
print("\tdados de teste      : ", test_df.shape);

n_cols: int = test_df.shape[1];
\end{verbatim}

Nosso objetivo é, a partir das \texttt{81}  colunas, predizer o valor da coluna \texttt{SalesPrice}. É observável também que os dados de teste possuem uma coluna a mais do que os dados de treinamento.
\subsubsection{Diferença na Quantidade de Colunas}
\label{sec:org94c0d02}
\begin{verbatim}
train_cols = set(train_df.columns)
test_cols  = set(test_df.columns)

missing_in_test = train_cols - test_cols
extra_in_test   = test_cols - train_cols

print("Colunas em `train`, mas não em `test` :", end="")
print(missing_in_test)
print("\nColunas em `test`, mas não em `train` :", end="")
print(extra_in_test)
\end{verbatim}
\begin{enumerate}
