lab-5/lab-notebook.org
**** Natureza das Colunas
Por inspeção visual dos dados, observamos que existem colunas /numéricas/ e colunas /categóricas/. Primeiro, vamos isolar a coluna que estamos interessados. Em seguida, vamos separar as colunas numéricas das colunas categóricas. É necessário verificar se estamos sendo capazes de extrair todas as colunas e se estamos seprando-as adequadamente.

#+BEGIN_SRC python :session lab-5 :results output
feature_cols = [col for col in test_df.columns if col != 'SalesPrice']  # test_df has no SalesPrice anyway

numerical_cols = test_df[feature_cols].select_dtypes(include=['int64', 'float64']).columns
categorical_cols = test_df[feature_cols].select_dtypes(include=['object', 'category']).columns

n_cols_numerical = len(numerical_cols)
n_cols_categorical = len(categorical_cols)

print("colunas numéricas  : ", n_cols_numerical)
print("colunas categóricas: ", n_cols_categorical)
total = n_cols_numerical + n_cols_categorical
print("total              : ", total, end="")
print(" -> ", total == n_cols)   # n_cols = test_df.shape[1] = 80
#+END_SRC

#+RESULTS:
: colunas numéricas  :  37
: colunas categóricas:  43
: total              :  80 ->  True

Vamos primeiro analisar questões de limpeza dos dados para tanto colunas numéricas quanto categóricas. Em seguida, analisaremos os dois conjuntos separadamente e, quando formos propriamente treinar o modelo, reuniremos as colunas.

É muito provável que existam /valores ausentes/ para algumas entradas. Vamos investigar:

#+BEGIN_SRC python :session lab-5 :results output
# treinamento
missing_train = train_df.isnull().sum()
missing_train = missing_train[missing_train > 0].sort_values(ascending=False)

print("Valores ausentes nos dados de treinamento: ")
print(missing_train)
print(f"\ntotal: {missing_train.sum()}")

# teste
missing_test = test_df.isnull().sum()
missing_test = missing_test[missing_test > 0].sort_values(ascending=False)

print("\nValores ausentes nos dados de teste:")
print(missing_test)
print(f"\ntotal: {missing_test.sum()}")
#+END_SRC

#+RESULTS:
#+begin_example
Valores ausentes nos dados de treinamento: 
PoolQC          1017
MiscFeature      982
Alley            956
Fence            820
MasVnrType       590
FireplaceQu      487
LotFrontage      190
GarageType        54
GarageYrBlt       54
GarageFinish      54
GarageQual        54
GarageCond        54
BsmtCond          26
BsmtFinType1      26
BsmtExposure      26
BsmtQual          26
BsmtFinType2      26
MasVnrArea         3
Electrical         1
dtype: int64

total: 5446

Valores ausentes nos dados de teste:
PoolQC          436
MiscFeature     424
Alley           413
Fence           359
MasVnrType      282
FireplaceQu     203
LotFrontage      69
GarageType       27
GarageFinish     27
GarageQual       27
GarageYrBlt      27
GarageCond       27
BsmtFinType2     12
BsmtExposure     12
BsmtCond         11
BsmtFinType1     11
BsmtQual         11
MasVnrArea        5
dtype: int64

total: 2383
#+end_example

Muitos valores faltando, tanto em colunas categóricas quanto numéricas, e tanto para os dados teste quanto para os dados de treinamento. A resolução deverá ser aplicada para ambos conjuntos (=train, test=) de forma análoga.

Existem algumas estratégias possíveis para lidar com este problema. Acaso uma coluna tenha mais do que cinquenta por cento de valores ausentes, será mesmo que ela é importante para a predição final?

#+BEGIN_SRC python :session lab-5 :results output
# Fazer uma cópia dos DataFrames para evitar perder valores
cleaned_train_df: pd.DataFrame = train_df.copy();
cleaned_test_df:  pd.DataFrame = test_df.copy();

# Definir threshold para eliminar colunas (>= 50%)
thresholds: list[float] = list(np.linspace(0.05, 0.99, num=20));
print(thresholds);

for threshold in thresholds:
    kill_cols_train = cleaned_train_df.columns[cleaned_train_df.isnull().mean() > threshold];
    kill_cols_test  = cleaned_test_df.columns[cleaned_test_df.isnull().mean() > threshold];
    kill_cols: set = set(kill_cols_test) | set(kill_cols_train)

    print("threshold `", threshold, "`\n\t ", list(kill_cols));

#+END_SRC

#+RESULTS:
#+begin_example
[np.float64(0.05), np.float64(0.09947368421052633), np.float64(0.14894736842105263), np.float64(0.19842105263157894), np.float64(0.24789473684210528), np.float64(0.29736842105263156), np.float64(0.3468421052631579), np.float64(0.3963157894736842), np.float64(0.4457894736842105), np.float64(0.49526315789473685), np.float64(0.5447368421052632), np.float64(0.5942105263157895), np.float64(0.6436842105263159), np.float64(0.6931578947368422), np.float64(0.7426315789473684), np.float64(0.7921052631578948), np.float64(0.8415789473684211), np.float64(0.8910526315789474), np.float64(0.9405263157894738), np.float64(0.99)]
threshold ` 0.05 `
	  ['MasVnrType', 'GarageYrBlt', 'GarageFinish', 'PoolQC', 'Fence', 'GarageQual', 'Alley', 'MiscFeature', 'LotFrontage', 'FireplaceQu', 'GarageType', 'GarageCond']
threshold ` 0.09947368421052633 `
	  ['MasVnrType', 'FireplaceQu', 'PoolQC', 'Fence', 'Alley', 'MiscFeature', 'LotFrontage']
threshold ` 0.14894736842105263 `
	  ['MasVnrType', 'FireplaceQu', 'PoolQC', 'Fence', 'Alley', 'MiscFeature', 'LotFrontage']
threshold ` 0.19842105263157894 `
	  ['MasVnrType', 'FireplaceQu', 'PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.24789473684210528 `
	  ['MasVnrType', 'FireplaceQu', 'PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.29736842105263156 `
	  ['MasVnrType', 'FireplaceQu', 'PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.3468421052631579 `
	  ['MasVnrType', 'FireplaceQu', 'PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.3963157894736842 `
	  ['MasVnrType', 'FireplaceQu', 'PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.4457894736842105 `
	  ['MasVnrType', 'FireplaceQu', 'PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.49526315789473685 `
	  ['MasVnrType', 'PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.5447368421052632 `
	  ['MasVnrType', 'PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.5942105263157895 `
	  ['MasVnrType', 'PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.6436842105263159 `
	  ['MasVnrType', 'PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.6931578947368422 `
	  ['PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.7426315789473684 `
	  ['PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.7921052631578948 `
	  ['PoolQC', 'Fence', 'Alley', 'MiscFeature']
threshold ` 0.8415789473684211 `
	  ['Alley', 'MiscFeature', 'PoolQC']
threshold ` 0.8910526315789474 `
	  ['Alley', 'MiscFeature', 'PoolQC']
threshold ` 0.9405263157894738 `
	  ['Alley', 'MiscFeature', 'PoolQC']
threshold ` 0.99 `
	  ['PoolQC']
#+end_example

Definimos um intervalo linear de $20$ valores entre =0.05= e =0.99= para os /thresholds/ de forma a mostrar quais colunas possuem valores faltando. Percebems que diveras colunas possuem pelo menos 5% dos valores ausentes: =['MasVnrType', 'GarageYrBlt', 'GarageFinish', 'PoolQC', 'Fence', 'GarageQual', 'Alley', 'MiscFeature', 'LotFrontage', 'FireplaceQu', 'GarageType', 'GarageCond']=; este é um intervalo baixo e não podemos decidir nossa análise sobre ele. O outro limite da nossa análise (=99%= dos valores ausentes) apresenta apenas a coluna =PoolQC=.

Certamente não podemos esperar que uma coluna com valores ausentes para 99% das entradas seja importante para predição. Alguns thresholds interssantes são =0.25, 0.50, 0.75=:

#+BEGIN_SRC python :session lab-5 :results output
for threshold in [0.1, 0.25, 0.50, 0.75, 0.9]:
    kill_cols_train = cleaned_train_df.columns[cleaned_train_df.isnull().mean() > threshold];
    kill_cols_test  = cleaned_test_df.columns[cleaned_test_df.isnull().mean() > threshold];
    kill_cols: set = set(kill_cols_test) | set(kill_cols_train)

    print("threshold `", threshold, "`\n", "\t".join(list(kill_cols)));

#+END_SRC

#+RESULTS:
#+begin_example
threshold ` 0.1 `
 MasVnrType	FireplaceQu	PoolQC	Fence	Alley	MiscFeature	LotFrontage
threshold ` 0.25 `
 MasVnrType	FireplaceQu	PoolQC	Fence	Alley	MiscFeature
threshold ` 0.5 `
 MasVnrType	PoolQC	Fence	Alley	MiscFeature
threshold ` 0.75 `
 PoolQC	Fence	Alley	MiscFeature
threshold ` 0.9 `
 Alley	MiscFeature	PoolQC
#+end_example

A decisão mais informada que tomamos é (1.) eliminar colunas com /muitos/ valores ausentes e (2.) decidir manualmente a partir de inspeção mais profunda, para colunas com quantidade intermediária de valores faltando.

***** Eliminar Colunas com Muitos Valores Ausentes
****** Decisão por coluna
#+BEGIN_SRC python :session lab-5 :results output
missing_ratio_train = train_df.isnull().mean().sort_values(ascending=False)
missing_ratio_test  = test_df.isnull().mean()

important_cols = ['MasVnrType', 'FireplaceQu', 'LotFrontage', 'GarageType']

print("Razões de ausência (train) — top 10:")
print(missing_ratio_train.head(10))
print("\nColunas que parecem ser importantes:")
for col in important_cols:
    if col in missing_ratio_train.index:
        print(f"{col}: train {missing_ratio_train[col]:.1%}, test {missing_ratio_test[col]:.1%}")
#+END_SRC

#+RESULTS:
#+begin_example
Razões de ausência (train) — top 10:
PoolQC          0.995108
MiscFeature     0.960861
Alley           0.935421
Fence           0.802348
MasVnrType      0.577299
FireplaceQu     0.476517
LotFrontage     0.185910
GarageQual      0.052838
GarageFinish    0.052838
GarageType      0.052838
dtype: float64

Colunas que parecem ser importantes:
MasVnrType: train 57.7%, test 64.4%
FireplaceQu: train 47.7%, test 46.3%
LotFrontage: train 18.6%, test 15.8%
GarageType: train 5.3%, test 6.2%
#+end_example

1. As colunas =PoolQC=, =MiscFeature= e =Alley= são altamente esparsas ($\geq 0.93$). Estas podem ser removidas sem detrimento à análise.
2. =Fence= é nosso /threshold/ verdadeiro (=0.8=). A partir daqui, queremos que os valores ausentes sejam substituídos por uma categoria real (neste caso, ou =NoFence= ou =None= simplesmente).
3. As colunas posteriores permancem, neste momento.

