lab-5/lab-notebook.tex
\item Natureza das Colunas
\label{sec:org6a8d5bb}
Por inspeção visual dos dados, observamos que existem colunas \emph{numéricas} e colunas \emph{categóricas}. Primeiro, vamos isolar a coluna que estamos interessados. Em seguida, vamos separar as colunas numéricas das colunas categóricas. É necessário verificar se estamos sendo capazes de extrair todas as colunas e se estamos seprando-as adequadamente.

\begin{verbatim}
feature_cols = [col for col in test_df.columns if col != 'SalesPrice']  # test_df has no SalesPrice anyway

numerical_cols = test_df[feature_cols].select_dtypes(include=['int64', 'float64']).columns
categorical_cols = test_df[feature_cols].select_dtypes(include=['object', 'category']).columns

n_cols_numerical = len(numerical_cols)
n_cols_categorical = len(categorical_cols)

print("colunas numéricas  : ", n_cols_numerical)
print("colunas categóricas: ", n_cols_categorical)
total = n_cols_numerical + n_cols_categorical
print("total              : ", total, end="")
print(" -> ", total == n_cols)   # n_cols = test_df.shape[1] = 80
\end{verbatim}

Vamos primeiro analisar questões de limpeza dos dados para tanto colunas numéricas quanto categóricas. Em seguida, analisaremos os dois conjuntos separadamente e, quando formos propriamente treinar o modelo, reuniremos as colunas.

É muito provável que existam \emph{valores ausentes} para algumas entradas. Vamos investigar:

\begin{verbatim}
# treinamento
missing_train = train_df.isnull().sum()
missing_train = missing_train[missing_train > 0].sort_values(ascending=False)

print("Valores ausentes nos dados de treinamento: ")
print(missing_train)
print(f"\ntotal: {missing_train.sum()}")

# teste
missing_test = test_df.isnull().sum()
missing_test = missing_test[missing_test > 0].sort_values(ascending=False)

print("\nValores ausentes nos dados de teste:")
print(missing_test)
print(f"\ntotal: {missing_test.sum()}")
\end{verbatim}

Muitos valores faltando, tanto em colunas categóricas quanto numéricas, e tanto para os dados teste quanto para os dados de treinamento. A resolução deverá ser aplicada para ambos conjuntos (\texttt{train, test}) de forma análoga.

Existem algumas estratégias possíveis para lidar com este problema. Acaso uma coluna tenha mais do que cinquenta por cento de valores ausentes, será mesmo que ela é importante para a predição final?

\begin{verbatim}
# Fazer uma cópia dos DataFrames para evitar perder valores
cleaned_train_df: pd.DataFrame = train_df.copy();
cleaned_test_df:  pd.DataFrame = test_df.copy();

# Definir threshold para eliminar colunas (>= 50%)
thresholds: list[float] = list(np.linspace(0.05, 0.99, num=20));
print(thresholds);

for threshold in thresholds:
    kill_cols_train = cleaned_train_df.columns[cleaned_train_df.isnull().mean() > threshold];
    kill_cols_test  = cleaned_test_df.columns[cleaned_test_df.isnull().mean() > threshold];
    kill_cols: set = set(kill_cols_test) | set(kill_cols_train)

    print("threshold `", threshold, "`\n\t ", list(kill_cols));

\end{verbatim}

Definimos um intervalo linear de \(20\) valores entre \texttt{0.05} e \texttt{0.99} para os \emph{thresholds} de forma a mostrar quais colunas possuem valores faltando. Percebems que diveras colunas possuem pelo menos 5\% dos valores ausentes: \texttt{['MasVnrType', 'GarageYrBlt', 'GarageFinish', 'PoolQC', 'Fence', 'GarageQual', 'Alley', 'MiscFeature', 'LotFrontage', 'FireplaceQu', 'GarageType', 'GarageCond']}; este é um intervalo baixo e não podemos decidir nossa análise sobre ele. O outro limite da nossa análise (\texttt{99\%} dos valores ausentes) apresenta apenas a coluna \texttt{PoolQC}.

Certamente não podemos esperar que uma coluna com valores ausentes para 99\% das entradas seja importante para predição. Alguns thresholds interssantes são \texttt{0.25, 0.50, 0.75}:

\begin{verbatim}
for threshold in [0.1, 0.25, 0.50, 0.75, 0.9]:
    kill_cols_train = cleaned_train_df.columns[cleaned_train_df.isnull().mean() > threshold];
    kill_cols_test  = cleaned_test_df.columns[cleaned_test_df.isnull().mean() > threshold];
    kill_cols: set = set(kill_cols_test) | set(kill_cols_train)

    print("threshold `", threshold, "`\n", "\t".join(list(kill_cols)));

\end{verbatim}

A decisão mais informada que tomamos é (1.) eliminar colunas com \emph{muitos} valores ausentes e (2.) decidir manualmente a partir de inspeção mais profunda, para colunas com quantidade intermediária de valores faltando.
\begin{enumerate}
\item Eliminar Colunas com Muitos Valores Ausentes
\label{sec:org1908837}
\begin{enumerate}
\item Decisão por coluna
\label{sec:orged8d3cf}
\begin{verbatim}
missing_ratio_train = train_df.isnull().mean().sort_values(ascending=False)
missing_ratio_test  = test_df.isnull().mean()

important_cols = ['MasVnrType', 'FireplaceQu', 'LotFrontage', 'GarageType']

print("Razões de ausência (train) — top 10:")
print(missing_ratio_train.head(10))
print("\nColunas que parecem ser importantes:")
for col in important_cols:
    if col in missing_ratio_train.index:
        print(f"{col}: train {missing_ratio_train[col]:.1%}, test {missing_ratio_test[col]:.1%}")
\end{verbatim}

\begin{enumerate}
\item As colunas \texttt{PoolQC}, \texttt{MiscFeature} e \texttt{Alley} são altamente esparsas (\(\geq 0.93\)). Estas podem ser removidas sem detrimento à análise.
\item \texttt{Fence} é nosso \emph{threshold} verdadeiro (\texttt{0.8}). A partir daqui, queremos que os valores ausentes sejam substituídos por uma categoria real (neste caso, ou \texttt{NoFence} ou \texttt{None} simplesmente).
\item As colunas posteriores permancem, neste momento.
\end{enumerate}
