lab-5/lab-notebook.tex
\item Limpeza Propriamente Dita
\label{sec:orga8aeac2}
\begin{verbatim}
cleaned_train = train_df.copy()
cleaned_test = test_df.copy()

# Colunas com muitos dados ausentes são eliminadas
cols_to_drop = ['PoolQC', 'MiscFeature', 'Alley', 'Fence']
cleaned_train = cleaned_train.drop(columns=cols_to_drop)
cleaned_test = cleaned_test.drop(columns=cols_to_drop)
\end{verbatim}
\end{enumerate}
\item Preencher Colunas com Valores Ausentes
\label{sec:orgb862646}
Ainda existem algumas colunas com valores ausentes e precisamos que estes sejam preenchidos para podermos avançar para as próximas etapas. Abaixo, vamos analisar coluna-a-coluna
\begin{verbatim}
# 1. Imputar valores ausentes em categorias com novas categorias
cleaned_train['MasVnrType'] = cleaned_train['MasVnrType'].fillna('None')
cleaned_test['MasVnrType'] = cleaned_test['MasVnrType'].fillna('None')

cleaned_train['FireplaceQu'] = cleaned_train['FireplaceQu'].fillna('NoFireplace')
cleaned_test['FireplaceQu'] = cleaned_test['FireplaceQu'].fillna('NoFireplace')

# *Garagem*: se ausente, então o imóvel não tem gargem
garage_cols = ['GarageType', 'GarageFinish', 'GarageQual', 'GarageCond']
for col in garage_cols:
    cleaned_train[col] = cleaned_train[col].fillna('NoGarage')
    cleaned_test[col] = cleaned_test[col].fillna('NoGarage')

# *Subsolo/Porão*: se ausente, não há subsolo
basement_cols = ['BsmtQual', 'BsmtCond', 'BsmtExposure', 'BsmtFinType1', 'BsmtFinType2']
for col in basement_cols:
    cleaned_train[col] = cleaned_train[col].fillna('NoBasement')
    cleaned_test[col] = cleaned_test[col].fillna('NoBasement')

# 2. Imputação para valores numéricos: 0, mediana, moda
# LotFrontage: mediana, a fim de evitar outliers
#              alguns imóveis podem ter `Frontage` muito grande, ou nula
median_lot = cleaned_train['LotFrontage'].median()
cleaned_train['LotFrontage'] = cleaned_train['LotFrontage'].fillna(median_lot)
cleaned_test['LotFrontage'] = cleaned_test['LotFrontage'].fillna(median_lot)

# MasVnrArea: 0 (-> sem alvenaria)
cleaned_train['MasVnrArea'] = cleaned_train['MasVnrArea'].fillna(0)
cleaned_test['MasVnrArea'] = cleaned_test['MasVnrArea'].fillna(0)

# GarageYrBlt: 0 (-> sem garagem)
cleaned_train['GarageYrBlt'] = cleaned_train['GarageYrBlt'].fillna(0)
cleaned_test['GarageYrBlt'] = cleaned_test['GarageYrBlt'].fillna(0)

# Electrical: difícil entender o que isto significa
#             -> moda, valor mais comum
mode_elec = cleaned_train['Electrical'].mode()[0]
cleaned_train['Electrical'] = cleaned_train['Electrical'].fillna(mode_elec)
cleaned_test['Electrical'] = cleaned_test['Electrical'].fillna(mode_elec)

# 3. Inspeção: ainda há valores faltando?
print(f"Valores ausentes: train = {cleaned_train.isnull().sum().sum()}, test = {cleaned_test.isnull().sum().sum()}")
if cleaned_train.isnull().sum().sum() == 0:
    print("\tLimpeza completa, não há mais valores ausentes.")
\end{verbatim}
\end{enumerate}
\end{enumerate}
\subsubsection{Pipeline para Pré-Processamento}
\label{sec:orgaf8528c}
Agora que a análise manual foi feita, podemos \textbf{refatorar} o código acima para usar estratégias mais modernas com as \emph{pipelines} do \texttt{sklearn}. Isto é interessante porque
\begin{enumerate}
\item é mais robusto e generalista;
\item elimina \emph{warnings} do tipo \texttt{FutureWarning}; e
\item faz uso das técnicas vigentes em Ciência de Dados.
\end{enumerate}

\begin{verbatim}
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer

# Carregar os dados
train_df = pd.read_csv("./lab05_files/lab05_files/train_student.csv")
test_df  = pd.read_csv("./lab05_files/lab05_files/test_student.csv")


print("1. Dados carregados. Dimensões:", train_df.shape, test_df.shape)

# Recomeçamos com cópias dos datasets iniciais
cleaned_train = train_df.copy()
cleaned_test = test_df.copy()

# 1. Eliminaremos colunas com >= 0.8 valores ausentes
cols_to_drop = ['PoolQC', 'MiscFeature', 'Alley', 'Fence']
cleaned_train.drop(columns=cols_to_drop, inplace=True)
cleaned_test.drop(columns=cols_to_drop, inplace=True)

print("2. Eliminadas colunas com >= 0.8 valores ausentes.")


# 2. Separar features (X) e target (y) para treinamento
X_train = cleaned_train.drop('SalePrice', axis=1)
y_train = cleaned_train['SalePrice']
X_test = cleaned_test

print(f"3. X_train dim.: {X_train.shape}")

# 3. Converter MSSubClass para string (categórica) antes da imputação
if 'MSSubClass' in X_train.columns:
    X_train['MSSubClass'] = X_train['MSSubClass'].astype(str)
    X_test['MSSubClass'] = X_test['MSSubClass'].astype(str)
    print("4. coluna `MSSubClass` convertida para `str`")

# 4. Definir colunas para imputação com zero (feature ausente = 0)
zero_impute_cols = [
    'MasVnrArea', 'GarageYrBlt', 'GarageCars', 'GarageArea',
    'BsmtFinSF1', 'BsmtFinSF2', 'BsmtUnfSF', 'TotalBsmtSF',
    'BsmtFullBath', 'BsmtHalfBath',
    'Fireplaces', 'PoolArea'
]
zero_impute_cols = [c for c in zero_impute_cols if c in X_train.columns]
print(f"5. Imputação de 0 para colunas numéricas com valores ausentes  ({len(zero_impute_cols)} colunas): {zero_impute_cols[:5]}...")

# 5. Colunas numéricas que receberão mediana
all_numerical = X_train.select_dtypes(include=['int64','float64']).columns.tolist()
median_impute_cols = [c for c in all_numerical if c not in zero_impute_cols and c != 'SalePrice']
print(f"6. Imputação da mediana para colunas numéricas ({len(median_impute_cols)} colunas): {median_impute_cols[:5]}...")

# 6. Colunas categóricas
categorical_cols = X_train.select_dtypes(include=['object','category']).columns.tolist()
print(f"7. Colunas categóricas ({len(categorical_cols)}): {categorical_cols[:5]}...")

# 7. Criar imputers
num_imputer_median = SimpleImputer(strategy='median')
num_imputer_zero   = SimpleImputer(strategy='constant', fill_value=0)
cat_imputer        = SimpleImputer(strategy='constant', fill_value='Missing')

# 8. ColumnTransformer
preprocessor = ColumnTransformer([
    ('median_impute', num_imputer_median, median_impute_cols),
    ('zero_impute',   num_imputer_zero,   zero_impute_cols),
    ('cat_impute',    cat_imputer,        categorical_cols)
], remainder='passthrough')

print("8. Pré-processamento das colunas pelos `SimpleImputer`s")
X_train_imputed = preprocessor.fit_transform(X_train)
X_test_imputed = preprocessor.transform(X_test)

print("9. Imputação terminada.")

# 10. Verificação
print(f"X_train dim. após imputação: {X_train_imputed.shape}")
print(f"X_test  dim. após imputação:  {X_test_imputed.shape}")
print("Término da primeira fase do pré-processamento.")
\end{verbatim}
\begin{enumerate}
\item Está Correto?
\label{sec:org2454961}
Sim, está correto. O log mostra exatamente o que se espera:

Dimensões:

Treino: (1022, 76) - pois de 81 colunas originais, removeu 4 (PoolQC, MiscFeature, Alley, Fence) e removeu o target SalePrice → 81 - 4 - 1 = 76.

Teste: (438, 76) - removeu as mesmas 4 colunas (teste não tem SalePrice) → 80 - 4 = 76.

Divisão das colunas:

Zero-impute: 12 colunas (ex.: GarageYrBlt, MasVnrArea).

Mediana: 24 colunas (ex.: LotFrontage).

Categóricas: 40 colunas (incluindo MSSubClass convertida para string).

Total: 12 + 24 + 40 = 76 → consistente.

Não há valores ausentes após a imputação (o código que você mostrou não exibe mais np.isnan, então provavelmente removemos essa verificação que dava erro de tipo).

Portanto, a primeira fase do pré-processamento (imputação) está perfeita.
\end{enumerate}
