lab-5/lab-notebook.org
** Pré-Processamento dos Dados: /Encoding/ e /Scaling/
Antes de produzir o modelo de regressão propriamente dito, ainda estamos interessados em duas estratégias para adequar os dados ao problema. Queremos /codificar/ (=encoding=) as colunas categóricas e /escalar/ (ou /normalizar/, *scaling*) as colunas numéricas.

#+BEGIN_SRC python :session lab-out :results output
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, mean_absolute_error, r2_score
import pandas as pd
import numpy as np

# 1. Verificação das listas de colunas e os DataFrames do bloco anterior
print("Colunas disponíveis :")
print(f"  median_impute_cols:   {len(median_impute_cols)}")
print(f"    zero_impute_cols:   {len(zero_impute_cols)}")
print(f"    categorical_cols:   {len(categorical_cols)}")
print(f"    total           :   {len(median_impute_cols) + len(zero_impute_cols) + len(categorical_cols)}")

# 2. Construir os pipelines para cada grupo e o transf. de colunas
numeric_median_pipe = Pipeline([
    ('impute_median', SimpleImputer(strategy='median')),
    ('scale', StandardScaler())
])

numeric_zero_pipe = Pipeline([
    ('impute_zero', SimpleImputer(strategy='constant', fill_value=0)),
    ('scale', StandardScaler())
])

categorical_pipe = Pipeline([
    ('impute_missing', SimpleImputer(strategy='constant', fill_value='Missing')),
    ('onehot', OneHotEncoder(handle_unknown='ignore', drop='first'))
])

# ColumnTransformer que aplica os três pipelines
preprocessor_final = ColumnTransformer([
    ('num_median', numeric_median_pipe, median_impute_cols),
    ('num_zero',   numeric_zero_pipe,   zero_impute_cols),
    ('cat',        categorical_pipe,    categorical_cols)
])

print("-" * 26);
print(preprocessor_final);

# 3. Transformar os dados
X_train_transformed = preprocessor_final.fit_transform(X_train, y_train)

print(X_train_transformed);
#+END_SRC

#+RESULTS:
#+begin_example
Colunas disponíveis :
  median_impute_cols:   24
    zero_impute_cols:   12
    categorical_cols:   40
    total           :   76
--------------------------
ColumnTransformer(transformers=[('num_median',
                                 Pipeline(steps=[('impute_median',
                                                  SimpleImputer(strategy='median')),
                                                 ('scale', StandardScaler())]),
                                 ['Id', 'LotFrontage', 'LotArea', 'OverallQual',
                                  'OverallCond', 'YearBuilt', 'YearRemodAdd',
                                  '1stFlrSF', '2ndFlrSF', 'LowQualFinSF',
                                  'GrLivArea', 'FullBath', 'HalfBath',
                                  'BedroomAbvGr', 'KitchenAbvGr',
                                  'TotRmsAbvGrd', 'WoodDe...
                                 ['MSSubClass', 'MSZoning', 'Street',
                                  'LotShape', 'LandContour', 'Utilities',
                                  'LotConfig', 'LandSlope', 'Neighborhood',
                                  'Condition1', 'Condition2', 'BldgType',
                                  'HouseStyle', 'RoofStyle', 'RoofMatl',
                                  'Exterior1st', 'Exterior2nd', 'MasVnrType',
                                  'ExterQual', 'ExterCond', 'Foundation',
                                  'BsmtQual', 'BsmtCond', 'BsmtExposure',
                                  'BsmtFinType1', 'BsmtFinType2', 'Heating',
                                  'HeatingQC', 'CentralAir', 'Electrical', ...])])
<Compressed Sparse Row sparse matrix of dtype 'float64'
	with 72222 stored elements and shape (1022, 256)>
  Coords	Values
  (0, 0)	-1.4010002194522344
  (0, 1)	0.42105530675622643
  (0, 2)	-0.030504326934116557
  (0, 3)	0.6360306899404667
  (0, 4)	0.39226602307074837
  (0, 5)	-0.03237831432095405
  (0, 6)	-0.7116443921195715
  (0, 7)	1.315652302523794
  (0, 8)	-0.8022940572937826
  (0, 9)	-0.12031324912961958
  (0, 10)	0.2878347334783199
  (0, 11)	0.7678403213813123
  (0, 12)	-0.7585169740083605
  (0, 13)	0.13517503373888548
  (0, 14)	-0.21231774308963808
  (0, 15)	0.27923395644884813
  (0, 16)	0.0034269173725175444
  (0, 17)	-0.7159741995831473
  (0, 18)	-0.34637152309704494
  (0, 19)	-0.1193172617185024
  (0, 20)	-0.2758963952862536
  (0, 21)	-0.12298707010850735
  (0, 22)	-0.5149436790713383
  (0, 23)	0.1402926736602034
  (0, 24)	1.0613724844923493
  :	:
  (1021, 118)	1.0
  (1021, 121)	1.0
  (1021, 137)	1.0
  (1021, 152)	1.0
  (1021, 155)	1.0
  (1021, 159)	1.0
  (1021, 164)	1.0
  (1021, 166)	1.0
  (1021, 171)	1.0
  (1021, 177)	1.0
  (1021, 181)	1.0
  (1021, 187)	1.0
  (1021, 193)	1.0
  (1021, 194)	1.0
  (1021, 203)	1.0
  (1021, 207)	1.0
  (1021, 209)	1.0
  (1021, 216)	1.0
  (1021, 221)	1.0
  (1021, 222)	1.0
  (1021, 235)	1.0
  (1021, 240)	1.0
  (1021, 242)	1.0
  (1021, 250)	1.0
  (1021, 254)	1.0
#+end_example

** Definição do Modelo de Regressão Linear e Treinamento
A definição do modelo /baseline/ é bastante simples, tratando-se apenas de regressão linear conforme disponibilizado pelo =sklearn=:

#+BEGIN_SRC python :session lab-out :results output
model = LinearRegression()

# Usando log-transform no target
y_train_log = np.log1p(y_train)

model.fit(X_train_transformed, y_train_log)
#+END_SRC

** Avaliação do Modelo /Baseline/

#+BEGIN_SRC python :session lab-out :results output
y_pred_log = model.predict(X_train_transformed)
y_pred = np.expm1(y_pred_log)

rmse = np.sqrt(mean_squared_error(y_train, y_pred))
mae  = mean_absolute_error(y_train, y_pred)
r2   = r2_score(y_train, y_pred)
rmse_log = np.sqrt(mean_squared_error(y_train_log, y_pred_log))

print("-" * 30)
print("11. Métricas no treino:")
print(f"RMSE (log): {rmse_log:.5f}")
print(f"RMSE: {rmse:.4f}")
print(f"MAE:  {mae:.4f}")
print(f"R²:   {r2:.4f}")

from sklearn.model_selection import cross_val_score

scores = -cross_val_score(
    model,
    X_train_transformed,
    y_train_log,
    scoring="neg_root_mean_squared_error",
    cv=5
)

print(f"CV RMSE (log): {scores.mean():.5f} ± {scores.std():.5f}")

y_test_pred_log = model.predict(X_test_transformed)
y_test_pred = np.expm1(y_test_pred_log)

print("12. Predições no conjunto de teste concluídas.")

submission = pd.DataFrame({
    "Id": test_df["Id"],
    "prediction": y_test_pred
})

submission.to_csv("submission.csv", index=False)
#+END_SRC

*** Resultados do Modelo /Baseline/
Métricas no treino:
- RMSE (log): 0.08926
- RMSE: 17406.9043
- MAE:  10889.9244
- R²:   0.9497
- CV RMSE (log): 0.18788 ± 0.05491

Em relação ao teste real, RMSE(log) ~= 0.23

* Modelo =stacking-ensemble 4=
:PROPERTIES:
:ID:       41bc175f-461d-4785-b1b3-39b2a5021acb
:END:
=stacking-ensemble 4= é um *stacking ensemble* de dois níveis: cinco modelos de gradient boosting como camada base e um blend de RidgeCV + ElasticNet como meta-modelo.


** Pré-processamento
*** Remoção de Outliers
Antes de qualquer modelagem, quatro filtros são aplicados ao conjunto de treino para eliminar observações atípicas que distorceriam o aprendizado:

#+begin_src python
train_df = train_df[train_df["GrLivArea"] < 4500]
train_df = train_df[~((train_df["GrLivArea"] > 4000) & (train_df["SalePrice"] < 200000))]
train_df = train_df[train_df["LotArea"] < 100000]
train_df = train_df[train_df["TotalBsmtSF"] < 6000]
#+end_src

O segundo filtro é especialmente importante: remove casas grandes =vendidas= a preço baixo, que são anomalias conhecidas do dataset Ames e prejudicam modelos de árvore.

*** Transformação da Variável Alvo

O target =SalePrice= é transformado com =log1p= antes do treino:

#+begin_src python
y = np.log1p(train_df["SalePrice"])
#+end_src

Isso aproxima a distribuição da normal, reduz a influência de valores extremos e é o formato esperado na submissão — as predições são entregues em escala logarítmica, sem reverter com =expm1=.

*** Imputação Contextual
Em vez de imputação genérica por mediana, os valores ausentes são tratados com base no domínio do problema:

- *Categóricas de ausência semântica* (ex: ~GarageType~, ~PoolQC~): NaN
significa que o imóvel não possui aquela característica, portanto preenchidos com a string ~"None"~.

- *Numéricas de área ou contagem* (ex: ~GarageArea~, ~BsmtFinSF1~):
imóveis sem garagem ou porão têm área zero, portanto preenchidos com ~0~.

- *Demais numéricas*: imputação por mediana dentro de cada fold de validação cruzada, usando ~SimpleImputer~.

*** Feature Engineering
A função =add_features= expande o conjunto original de 80 para 103 features, agrupadas em quatro categorias:

**** Agregações de Área

#+begin_src python
df["TotalSF"]    = df["TotalBsmtSF"] + df["1stFlrSF"] + df["2ndFlrSF"]
df["TotalPorchSF"] = df["OpenPorchSF"] + df["EnclosedPorch"] + ...
df["TotalBathrooms"] = df["FullBath"] + 0.5*df["HalfBath"] + ...
#+end_src

Capturam a área utilizável total, que é mais preditiva que qualquer área individual.

