lab-5/lab-notebook.tex
\subsection{Pré-Processamento dos Dados: \emph{Encoding} e \emph{Scaling}}
\label{sec:org50e751b}
Antes de produzir o modelo de regressão propriamente dito, ainda estamos interessados em duas estratégias para adequar os dados ao problema. Queremos \emph{codificar} (\texttt{encoding}) as colunas categóricas e \emph{escalar} (ou \emph{normalizar}, \textbf{scaling}) as colunas numéricas.

\begin{verbatim}
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, mean_absolute_error, r2_score
import pandas as pd
import numpy as np

# 1. Verificação das listas de colunas e os DataFrames do bloco anterior
print("Colunas disponíveis :")
print(f"  median_impute_cols:   {len(median_impute_cols)}")
print(f"    zero_impute_cols:   {len(zero_impute_cols)}")
print(f"    categorical_cols:   {len(categorical_cols)}")
print(f"    total           :   {len(median_impute_cols) + len(zero_impute_cols) + len(categorical_cols)}")

# 2. Construir os pipelines para cada grupo e o transf. de colunas
numeric_median_pipe = Pipeline([
    ('impute_median', SimpleImputer(strategy='median')),
    ('scale', StandardScaler())
])

numeric_zero_pipe = Pipeline([
    ('impute_zero', SimpleImputer(strategy='constant', fill_value=0)),
    ('scale', StandardScaler())
])

categorical_pipe = Pipeline([
    ('impute_missing', SimpleImputer(strategy='constant', fill_value='Missing')),
    ('onehot', OneHotEncoder(handle_unknown='ignore', drop='first'))
])

# ColumnTransformer que aplica os três pipelines
preprocessor_final = ColumnTransformer([
    ('num_median', numeric_median_pipe, median_impute_cols),
    ('num_zero',   numeric_zero_pipe,   zero_impute_cols),
    ('cat',        categorical_pipe,    categorical_cols)
])

print("-" * 26);
print(preprocessor_final);

# 3. Transformar os dados
X_train_transformed = preprocessor_final.fit_transform(X_train, y_train)

print(X_train_transformed);
\end{verbatim}
\subsection{Definição do Modelo de Regressão Linear e Treinamento}
\label{sec:org5564d96}
A definição do modelo \emph{baseline} é bastante simples, tratando-se apenas de regressão linear conforme disponibilizado pelo \texttt{sklearn}:

\begin{verbatim}
model = LinearRegression()

# Usando log-transform no target
y_train_log = np.log1p(y_train)

model.fit(X_train_transformed, y_train_log)
\end{verbatim}
\subsection{Avaliação do Modelo \emph{Baseline}}
\label{sec:org46b34fe}

\begin{verbatim}
y_pred_log = model.predict(X_train_transformed)
y_pred = np.expm1(y_pred_log)

rmse = np.sqrt(mean_squared_error(y_train, y_pred))
mae  = mean_absolute_error(y_train, y_pred)
r2   = r2_score(y_train, y_pred)
rmse_log = np.sqrt(mean_squared_error(y_train_log, y_pred_log))

print("-" * 30)
print("11. Métricas no treino:")
print(f"RMSE (log): {rmse_log:.5f}")
print(f"RMSE: {rmse:.4f}")
print(f"MAE:  {mae:.4f}")
print(f"R²:   {r2:.4f}")

from sklearn.model_selection import cross_val_score

scores = -cross_val_score(
    model,
    X_train_transformed,
    y_train_log,
    scoring="neg_root_mean_squared_error",
    cv=5
)

print(f"CV RMSE (log): {scores.mean():.5f} ± {scores.std():.5f}")

y_test_pred_log = model.predict(X_test_transformed)
y_test_pred = np.expm1(y_test_pred_log)

print("12. Predições no conjunto de teste concluídas.")

submission = pd.DataFrame({
    "Id": test_df["Id"],
    "prediction": y_test_pred
})

submission.to_csv("submission.csv", index=False)
\end{verbatim}
\subsubsection{Resultados do Modelo \emph{Baseline}}
\label{sec:orgbff5ae6}
Métricas no treino:
\begin{itemize}
\item RMSE (log): 0.08926
\item RMSE: 17406.9043
\item MAE:  10889.9244
\item R²:   0.9497
\item CV RMSE (log): 0.18788 ± 0.05491
\end{itemize}

Em relação ao teste real, RMSE(log) \textasciitilde{}= 0.23
\section{Modelo \texttt{stacking-ensemble 4}}
\label{sec:org8c692e8}
\texttt{stacking-ensemble 4} é um \textbf{stacking ensemble} de dois níveis: cinco modelos de gradient boosting como camada base e um blend de RidgeCV + ElasticNet como meta-modelo.
\subsection{Pré-processamento}
\label{sec:org4aef768}
\subsubsection{Remoção de Outliers}
\label{sec:org87c76cf}
Antes de qualquer modelagem, quatro filtros são aplicados ao conjunto de treino para eliminar observações atípicas que distorceriam o aprendizado:

\begin{verbatim}
train_df = train_df[train_df["GrLivArea"] < 4500]
train_df = train_df[~((train_df["GrLivArea"] > 4000) & (train_df["SalePrice"] < 200000))]
train_df = train_df[train_df["LotArea"] < 100000]
train_df = train_df[train_df["TotalBsmtSF"] < 6000]
\end{verbatim}

O segundo filtro é especialmente importante: remove casas grandes \texttt{vendidas} a preço baixo, que são anomalias conhecidas do dataset Ames e prejudicam modelos de árvore.
\subsubsection{Transformação da Variável Alvo}
\label{sec:orge9fd220}

O target \texttt{SalePrice} é transformado com \texttt{log1p} antes do treino:

\begin{verbatim}
y = np.log1p(train_df["SalePrice"])
\end{verbatim}

Isso aproxima a distribuição da normal, reduz a influência de valores extremos e é o formato esperado na submissão — as predições são entregues em escala logarítmica, sem reverter com \texttt{expm1}.
\subsubsection{Imputação Contextual}
\label{sec:org9bd6a0c}
Em vez de imputação genérica por mediana, os valores ausentes são tratados com base no domínio do problema:

\begin{itemize}
\item \textbf{Categóricas de ausência semântica} (ex: \texttt{GarageType}, \texttt{PoolQC}): NaN
\end{itemize}
significa que o imóvel não possui aquela característica, portanto preenchidos com a string \texttt{"None"}.

\begin{itemize}
\item \textbf{Numéricas de área ou contagem} (ex: \texttt{GarageArea}, \texttt{BsmtFinSF1}):
\end{itemize}
imóveis sem garagem ou porão têm área zero, portanto preenchidos com \texttt{0}.

\begin{itemize}
\item \textbf{Demais numéricas}: imputação por mediana dentro de cada fold de validação cruzada, usando \texttt{SimpleImputer}.
\end{itemize}
\subsubsection{Feature Engineering}
\label{sec:orge54c152}
A função \texttt{add\_features} expande o conjunto original de 80 para 103 features, agrupadas em quatro categorias:
\begin{enumerate}
\item Agregações de Área
\label{sec:orgba0fdea}

\begin{verbatim}
df["TotalSF"]    = df["TotalBsmtSF"] + df["1stFlrSF"] + df["2ndFlrSF"]
df["TotalPorchSF"] = df["OpenPorchSF"] + df["EnclosedPorch"] + ...
df["TotalBathrooms"] = df["FullBath"] + 0.5*df["HalfBath"] + ...
\end{verbatim}

Capturam a área utilizável total, que é mais preditiva que qualquer área individual.
