lab-5/lab-notebook.org
**** Flags Binárias de Presença

#+begin_src python
df["HasPool"]      = (df["PoolArea"] > 0).astype(int)
df["HasGarage"]    = (df["GarageArea"] > 0).astype(int)
df["HasBsmt"]      = (df["TotalBsmtSF"] > 0).astype(int)
df["HasFireplace"] = (df["Fireplaces"] > 0).astype(int)
df["IsRemodeled"]  = (df["YearRemodAdd"] != df["YearBuilt"]).astype(int)
df["IsNew"]        = (df["YrSold"] == df["YearBuilt"]).astype(int)
#+end_src

Modelos de árvore beneficiam-se de splits binários explícitos quando a distinção presença/ausência é mais relevante que a magnitude.

**** Interações Multiplicativas

#+begin_src python
df["OverallQual_TotalSF"]   = df["OverallQual"] * df["TotalSF"]
df["OverallQual_GrLivArea"] = df["OverallQual"] * df["GrLivArea"]
df["OverallQual_sq"]        = df["OverallQual"] ** 2
df["QualCondScore"]         = df["OverallQual"] * df["OverallCond"]
#+end_src

=OverallQual= é a variável mais correlacionada com preço. Suas
interações com área capturam o efeito não-linear de que qualidade
importa proporcionalmente mais em casas grandes.

**** Transformações Logarítmicas e Temporais

#+begin_src python
df["LotAreaLog"]  = np.log1p(df["LotArea"])
df["GrLivAreaLog"]= np.log1p(df["GrLivArea"])
df["HouseAge"]    = df["YrSold"] - df["YearBuilt"]
df["RemodAge"]    = df["YrSold"] - df["YearRemodAdd"]
#+end_src

/Log-transforms/ reduzem a /skewness/ de variáveis de área, ajudando especialmente o meta-modelo linear. As features de idade capturam depreciação e o efeito de reformas recentes.

** Encoding de Variáveis Categóricas

As 44 variáveis categóricas são transformadas com *Target Encoding* dentro de cada fold:

#+begin_src python
enc = ce.TargetEncoder(cols=cat_cols, smoothing=10)
enc.fit(X_tr, y_tr)
#+end_src

O parâmetro =smoothing=10= é crítico: mistura a média da categoria com a média global proporcionalmente ao tamanho da categoria, evitando /data leakage/ em categorias raras. O valor 10 (versus 0.3 do baseline) reduz significativamente o /overfitting/ do /encoding/.

O encoder é sempre /fitado/ apenas nos dados de treino do fold e aplicado em validação e teste, respeitando o isolamento de
informação da validação cruzada.

** Definição de Modelos Base
Cinco modelos de /gradient boosting/ com hiperparâmetros distintos formam a camada base do /ensemble/. A diversidade entre eles é intencional para que erros não correlacionados se cancelam no stacking.

| Modelo | =n_estimators= | =learning_rate= | =num_leaves=/=depth= | Característica          |
|--------+--------------+---------------+--------------------+-------------------------|
| LGB1   | 6000         | 0.005         | 31                 | Conservador, balanceado |
| LGB2   | 8000         | 0.003         | 15                 | Raso, muito regularizado|
| LGB3   | 5000         | 0.008         | 63                 | Muitas folhas, agressivo|
| Cat    | 5000         | 0.007         | 6                  | Melhor OOF individual   |
| XGB    | 5000         | 0.005         | 5                  | Complementa LGB/Cat     |

OOF RMSE individuais (seed 42):
- LGB1: 0.126874
- LGB2: 0.123090
- LGB3: 0.119819
- CatBoost: *0.116575* (melhor)
- XGBoost: 0.125426

** Validação Cruzada (Out-of-Fold)

#+begin_src python
kf = KFold(n_splits=10, shuffle=True, random_state=42)
#+end_src

10 folds foram utilizados em vez dos 5 do baseline por dois motivos: cada modelo é avaliado em 10 conjuntos distintos, reduzindo a variância da estimativa de RMSE; e cada modelo de treino usa 90% dos dados em vez de 80%, gerando predições mais fortes.

As predições /Out-of-Fold/ (OOF) são usadas como features para o meta-modelo, garantindo que o meta-modelo nunca veja predições feitas sobre dados em que o modelo base foi treinado.

** Meta-Modelo (/Stacking/)
As predições OOF dos cinco modelos base formam uma matriz de entrada para dois meta-modelos:

#+begin_src python
# Meta 1
meta_ridge = RidgeCV(alphas=np.logspace(-4, 2, 50), cv=10)
meta_ridge.fit(X_meta, y)   # RMSE: 0.113588

# Meta 2
meta_en = ElasticNet(alpha=0.0003, l1_ratio=0.5, max_iter=50000)
meta_en.fit(X_meta, y)      # RMSE: 0.114635

# Blend final (50/50)
final = 0.5 * meta_ridge.predict(...) + 0.5 * meta_en.predict(...)
# RMSE: 0.113965
#+end_src

=RidgeCV= seleciona automaticamente o melhor =alpha= entre 50 valores via /cross-validation/ interna. O /blend/ 50/50 com =ElasticNet= reduz ligeiramente a variância da predição final em relação a usar apenas um dos dois.

** Resultados para o Modelo =stacking-ensemble 4=
- OOF RMSE FINAL (blend meta):  0.113965
- OOF RMSE FINAL (média direta): 0.119427

*** Decisões de Design para o Modelo =stacking-ensemble 4=
| Decisão                        | Alternativa descartada        | Motivo                                      |
|--------------------------------+-------------------------------+---------------------------------------------|
| Imputação contextual por domínio | Mediana global               | NaN em GarageArea significa 0, não mediana  |
| RobustScaler                   | StandardScaler                | Mais estável com outliers remanescentes      |
| TargetEncoding smoothing=10    | smoothing=0.3                 | Menos leakage em categorias raras           |
| 10-fold CV                     | 5-fold                        | Menor variância, mais dados por treino      |
| 5 modelos heterogêneos         | Apenas LightGBM               | Erros não correlacionados melhoram o blend  |
| RidgeCV como meta              | ElasticNet puro               | Seleção automática de alpha, mais estável   |
| Predição em log scale          | ~expm1~ antes de submeter     | Formato exigido pela competição             |
